#include<bits/stdc++.h>
using namespace std;

string a[200]={"钱温瑜","王智志","龚坚成","方思淼","曹雨彤","曹光熙","邱和同","姚文栋","邵建义","孟俊明","常温瑜","龙飞光","谢嘉实","宋永寿","王涵畅","侯乐正","顾元忠","蒋丰茂","汤宏畅","曹宏深","丁文耀","阎嘉悦","范承福","贾和裕","段泰和","郭英奕","田阳华","马高卓","魏志勇","秦康胜","唐经义","岳定评","孟嘉誉","叶阳炎","沈信鸿","段文林","潘乐人","邱高峯","毛阳文","顾华茂","阎乐游","吴俊喆","崔心远","于鸿达","于雨泽","林高澹","赖昊英","董翰音","邓凯捷","邱泰宁","潘俊贤","史俊远","毛天空","赵刚豪","许阳旭","吕玉泉","张高原","梁学真","孟嘉许","高永思","卢康成","钟琪睿","江建木","常睿慈","钟成双","江俊能","石斌斌","夏向明","金嘉年","崔和畅","康宏盛","林朋义","龙良工","马乐生","漕博涛","秦鸿煊","董正浩","黄成双","蒋玉书","阎泰宁","石阳飇","漕宜民","侯睿明","萧绍钧","邓英才","侯英喆","田承颜","冯立人","黄嘉誉","许嘉誉","魏弘光","卢翰林","康欣德","彭光远","曾坚白","傅和歌","郭和璧","罗承教","黄翰翮","胡阳嘉","田睿诚","夏文斌","宋康复","梁鸿运","冯飞扬","于良骏","赖建木","卢信厚","孟承颜","潘浩初","龚浩渺","阎飞章","宋正志","万嘉树","高元嘉","潘弘大","黄绍钧","程弘量","龚睿诚","贺天和","陆绍祺","汤彬炳","陈朋义","赖乐邦","秦鹏池","袁鸿云","苏欣然","孔俊风","贾宏才","邱鸿宝","朱宏大","朱和光","冯元良","常高兴","谭阳文","熊永安","田雅惠","姜元龙","杨高芬","漕锐精","韩和悦","邓阳波","王玉成","阎建华","曹星光","郝烨烁","郑祺然","武星汉","戴成仁","乔阳荣","苏文耀","金安国","金文乐","蔡乐湛","冯苑博","罗晋鹏","丁鹏运","林修然","杨飞跃","马鸿才","郝德寿","丁弘伟","王敏达","叶元青","沈志泽","汪立果","卢弘大","徐经艺","谭翰池","许奇希","汤嘉誉","白恺歌","陆鸿禧","杜蕴藉","钱经赋","漕志专","蔡阳晖","金烨霖","彭子民","谢经略","邱子实","钟阳曦","陈翰采","方雨信","尹欣怡","钟成益","韩嘉誉","傅嘉颖","邹睿诚","胡俊力","周锐达","马文滨","方志诚","田逸春","杜昊空","黎玉轩","朱阳荣","谢成双","卢彭湃","吕飞翼"};
    
int rand_int(int Num)//随机数生成
{
	vector<int> temp;
	for (int i = 0; i < Num; i++)
	{
		temp.push_back(i + 1);
	}
	random_shuffle(temp.begin(), temp.end());
	return temp[3];//随手6
}

int main()
{
    ofstream aaaoutfile("history_data.txt", ios::out);//清空
    ofstream outfile("history_data.txt", ios::app);
    int timess[7];
    for(int i=0;i<7;i++)
    {
        timess[i]=i+1;
    }
    for(int i=0;i<200;i++)
    {
        int time=timess[rand_int(6)];//防止出现0
        outfile<<a[i]<<" ";
        outfile<<time<<" ";
        int elemts[5];
        for(int i=0;i<5;i++)
        {
            elemts[i]=i+1;
        }
        for(int i=0;i<time;i++)
        {
            outfile<<elemts[rand_int(10)%5]<<" ";//防止出现0
            outfile<<rand_int(49)+1<<" ";
            outfile<<rand_int(10)+1<<" ";
        }
    }
}